In [1]:
#
#
#

import pandas as pd
import numpy as np

In [2]:
dates = pd.date_range('1/1/2000', periods=8)
dates

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07', '2000-01-08'],
              dtype='datetime64[ns]', freq='D')

In [3]:
np.random.seed(0)
df = pd.DataFrame(np.random.randn(8, 4),
                  index=dates, columns=['A', 'B', 'C', 'D'])
df

                   A         B         C         D
2000-01-01  1.764052  0.400157  0.978738  2.240893
2000-01-02  1.867558 -0.977278  0.950088 -0.151357
2000-01-03 -0.103219  0.410599  0.144044  1.454274
2000-01-04  0.761038  0.121675  0.443863  0.333674
2000-01-05  1.494079 -0.205158  0.313068 -0.854096
2000-01-06 -2.552990  0.653619  0.864436 -0.742165
2000-01-07  2.269755 -1.454366  0.045759 -0.187184
2000-01-08  1.532779  1.469359  0.154947  0.378163

In [4]:
s = df['A']
s[dates[5]]

-2.5529898158340787

In [5]:
df

                   A         B         C         D
2000-01-01  1.764052  0.400157  0.978738  2.240893
2000-01-02  1.867558 -0.977278  0.950088 -0.151357
2000-01-03 -0.103219  0.410599  0.144044  1.454274
2000-01-04  0.761038  0.121675  0.443863  0.333674
2000-01-05  1.494079 -0.205158  0.313068 -0.854096
2000-01-06 -2.552990  0.653619  0.864436 -0.742165
2000-01-07  2.269755 -1.454366  0.045759 -0.187184
2000-01-08  1.532779  1.469359  0.154947  0.378163

In [6]:
df[['B', 'A']] = df[['A', 'B']]
df

                   A         B         C         D
2000-01-01  0.400157  1.764052  0.978738  2.240893
2000-01-02 -0.977278  1.867558  0.950088 -0.151357
2000-01-03  0.410599 -0.103219  0.144044  1.454274
2000-01-04  0.121675  0.761038  0.443863  0.333674
2000-01-05 -0.205158  1.494079  0.313068 -0.854096
2000-01-06  0.653619 -2.552990  0.864436 -0.742165
2000-01-07 -1.454366  2.269755  0.045759 -0.187184
2000-01-08  1.469359  1.532779  0.154947  0.378163

In [7]:
df[['A', 'B']].to_numpy()

array([[ 0.40015721,  1.76405235],
       [-0.97727788,  1.86755799],
       [ 0.4105985 , -0.10321885],
       [ 0.12167502,  0.76103773],
       [-0.20515826,  1.49407907],
       [ 0.6536186 , -2.55298982],
       [-1.45436567,  2.26975462],
       [ 1.46935877,  1.53277921]])

In [8]:
#
#
#

sa = pd.Series([1, 2, 3], index=list('abc'))
print(type(sa))
dfa = df.copy()

<class 'pandas.core.series.Series'>

In [9]:
sa.b

2

In [10]:
dfa.A

2000-01-01    0.400157
2000-01-02   -0.977278
2000-01-03    0.410599
2000-01-04    0.121675
2000-01-05   -0.205158
2000-01-06    0.653619
2000-01-07   -1.454366
2000-01-08    1.469359
Freq: D, Name: A, dtype: float64

In [11]:
x = pd.DataFrame({'x': [1, 2, 3], 'y': [3, 4, 5]})
x

   x  y
0  1  3
1  2  4
2  3  5

In [12]:
x.iloc[1] = {'x': 9, 'y': 99}

In [13]:
x

   x   y
0  1   3
1  9  99
2  3   5

In [14]:
df = pd.DataFrame({'one': [1., 2., 3.]})
df.two = [4, 5, 6]
# UserWarning: Pandas doesn't allow Series to be assigned into nonexistent columns - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute_access
df

<ipython-input-14-c2d783fb81fa>:2: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  df.two = [4, 5, 6]

   one
0  1.0
1  2.0
2  3.0

In [15]:
df['two'] = [4, 5, 6]

In [16]:
df

   one  two
0  1.0    4
1  2.0    5
2  3.0    6

In [17]:
pd.date_range('20130101', periods=10)

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06', '2013-01-07', '2013-01-08',
               '2013-01-09', '2013-01-10'],
              dtype='datetime64[ns]', freq='D')